package com.nomen.ntrain.util;
/**
 * 各个系统审核流程状态值以及对应描述
 * @author 连金亮
 * @date   2013-07-01
 */
public enum CheckRemarkEnum {
	/**================================================**/
	/**=======0（某某填写/登记/编制/申请/报名）==============**/
	/**=例如：缺勤填写/项目登记/计划编制/开票申请/学员报名等 ====**/
	/**================================================**/
	C_1001(1001,"待申报"),
	C_2101(2101,"待部门审核"),

	/**=================================================**/
	/**=======41（人资/培训中心审核/审定/确认）===============**/
	/**=例如：缺勤审核/项目审核/计划审核/开票审核/报名审核等======**/
	/**==================================================**/
	C_3501(3501,"待人资审核"),
	C_3502(3502,"待人资审定"),
	C_3503(3503,"待人资确认"),
	C_3551(3551,"人资审核通过"),
	C_3552(3552,"人资审核不通过"),
	C_3555(3555,"人资审核同意"),
	C_3556(3556,"人资审核不同意"),
	
	/**=================================================**/
	/**===================55（分管审核）===================**/
	/**=例如：缺勤审核/项目审核/计划审核/开票审核/报名审核等======**/
	/**==================================================**/
	C_5501(5501,"待分管审核"),
	C_5502(5502,"待分管审定"),
	C_5503(5503,"待分管确认"),
	C_5551(5551,"分管审核通过"),
	C_5552(5552,"分管审核不通过"),
	C_5555(5555,"分管审核同意"),
	C_5556(5556,"分管审核不同意"),

	/**=================================================**/
	/**=======51（某某审核/审定/确认）======================**/
	/**=例如：缺勤审核/项目审核/计划审核/开票审核/报名审核等======**/
	/**=================================================**/
	C_5101(5101,"待审核"),
	C_5102(5102,"待审定"),
	C_5103(5103,"待确认"),
	C_5151(5151,"通过"),
	C_5152(5152,"不通过"),
	C_5155(5155,"同意"),
	C_5156(5156,"不同意");
	
	
	private int    key;
	private String desc;
	
	/**
	 * 构造方法
	 * @param eV
	 * @param eD
	 */
	private CheckRemarkEnum(int key,String desc){
		this.key = key;
		this.desc = desc;
	}
	
	/**
	 * 类似Integer.valueOf设置方法
	 * @param key
	 * @return
	 */
	public static CheckRemarkEnum valueOf(int key){
		CheckRemarkEnum[] obj=CheckRemarkEnum.values();
		for (CheckRemarkEnum cs: obj){
			if (cs.getKey()==key){
				return cs;
			}
		}
		return null;
	}
 
	//set get方法
	public int getKey() {
		return key;
	}

	public void setKey(int key) {
		this.key = key;
	}

	public String getDesc() {
		return desc;
	}

	public void setDesc(String desc) {
		this.desc = desc;
	}
}
